const data = {
coffee:[
["إسبريسو سينجل",35],
["إسبريسو دبل",50],
["قهوة تركي سينجل",30],
["قهوة تركي دبل",40],
["قهوة غامق",40],
["فرنش كوفي سينجل",50],
["فرنش كوفي دبل",60],
["نسكافيه بلاك",30],
["نسكافيه ميلك",60],
["ماكياتو",40],
["ماكياتو كراميل",45],
["كابتشينو",75],
["لاتيه",75],
["سبانيش لاتيه",85],
["موكا",80],
["وايت موكا",80],
["فلات وايت",75],
["أمريكانو",45],
["كورتادو",55]
],
hot:[
["شاي",22],
["شاي ميلك",40],
["شاي بنكهات",35],
["أعشاب",35],
["فيتامين سي",55],
["شاي أخضر",30],
["سحلب فروت",80],
["سحلب مكسرات",95],
["آبل سيدر",45]
],
chocolate:[
["هوت شوكليت كلاسيك",75],
["هوت مارشميلو",80],
["هوت وايت شوكليت",75],
["هوت نوتيلا",85],
["هوت أوريو",80],
["هوت كيت كات",90],
["هوت هوهوز",80],
["هوت لوتس",85]
],
iced:[
["آيس لاتيه",75],
["آيس سبانيش لاتيه",85],
["آيس موكا",80],
["آيس وايت موكا",80],
["آيس أمريكانو",55],
["آيس كراميل",80],
["آيس بندق",80],
["آيس ماكياتو",60],
["آيس ماكياتو كراميل",65]
],
frappe:[
["فرابيه شوكليت",90],
["فرابيه فانيليا",90],
["فرابيه كراميل",95],
["فرابيه نوتيلا",95],
["فرابيه فستق",100]
],
juice:[
["ليمون فريش",60],
["ليمون بالنعناع",70],
["برتقال",60],
["بطيخ",70],
["جوافة",60],
["فراولة",60],
["موز حليب",70],
["فراولة بالموز",75],
["عصير أناناس",90],
["عصير مانجو",70],
["عصير كيوي",90],
["عصير كنتالوب",70],
["كوكتيل فريش",95],
["أفوكادو بالعسل",100],
["أفوكادو فستق",130]
],
dessert:[
["دوناتس",80],
["براونيز",90],
["مولتن كيك",90],
["مولتن كيك آيس",100],
["تيراميسو",120],
["تشيز كيك",80],
["ماتيلدا كيك",110],
["أم علي",100],
["أم علي فروت",120],
["أم علي نوتيلا",120],
["فروت سالاد",75],
["فروت سالاد آيس",90]
]
};

function render(){
let html="";
for(const cat in data){
html+=`<section id="${cat}"><h2>${cat}</h2>`;
data[cat].forEach(i=>{
html+=`<div class="item"><span>${i[0]}</span><b>${i[1]}</b></div>`;
});
html+="</section>";
}
document.getElementById("menu").innerHTML=html;
}
render();

document.getElementById("search").oninput=(e)=>{
let val=e.target.value.toLowerCase();
document.querySelectorAll(".item").forEach(it=>{
it.style.display=it.innerText.toLowerCase().includes(val)?"flex":"none";
});
};
